src/Documents/Scan_ЗаявкаНаСервисныеРаботы/Scan_ЗаявкаНаСервисныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗаявкаНаСервисныеРаботы</name>
  <basedOn>Document.Scan_ЗаявкаНаДействие</basedOn>
  <basedOn>Document.Scan_ЗаявкаПеревозчику</basedOn>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаПодтвержденнаяИсполнителем</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержденоИсполнителем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведенияРабот</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявкиВ1БД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
      <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаВнутренний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЗаявки</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>КодНеисправнойДетали</name>
      <type>
        <types>CatalogRef.Scan_КодыНеисправныхДеталей</types>
      </type>
    </attributes>
    <attributes>
      <name>КодДефекта</name>
      <type>
        <types>CatalogRef.Scan_КодыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Scan_ВидыСервисныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Тахограф</name>
      <type>
        <types>CatalogRef.Scan_ВидыТахографов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующие</name>
      <type>
        <types>CatalogRef.Scan_Комплектующие</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОбращенияНаСервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаряд</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказНаряда</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРаботБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРаботНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID_ZN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID_ZNN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Scan_СтатусыЗаявокНаРаботы/Scan_СтатусыЗаявокНаРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СтатусыЗаявокНаРаботы</name>
  <predefined>
    <items>
      <name>Аннулирована</name>
      <description>Аннулирована</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Исполнена</name>
      <description>Исполнена</description>
    </items>
    <items>
      <name>Новая</name>
      <description>Новая</description>
    </items>
    <items>
      <name>Подтверждена</name>
      <description>Подтверждена</description>
    </items>
    <items>
      <name>Рассмотрена</name>
      <description>Рассмотрена</description>
    </items>
  </predefined>
  <attributes>
    <name>НедоступноДляВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок сортировки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <comment>Цвет заказ-наряда в журналах</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Шрифт</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/Scan_ДопРаботыИДоукомплектование/Module.bsl
Процедура Scan_ПриЗаписиОтправленныеПисьмаПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	////
	//Если Не Отказ Тогда
	//
	//	Для Каждого Запись Из Источник Цикл
	//		//rarus tenkam 23.11.2017 bug 9428 +++
	//		Если ТипЗнч(Запись.ДокументОтправки) = Тип("ДокументСсылка.Scan_ЗаявкаНаСервисныеРаботы") Тогда
	//		//rarus tenkam 23.11.2017 bug 9428 ---
	//			УстановитьНовыйВнутреннийНомер(Запись.ДокументОтправки);
	//			
	//		КонецЕсли;	//rarus tenkam 23.11.2017 bug 9428 +
	//	КонецЦикла;	
	//
	//КонецЕсли;
	
КонецПроцедуры

Процедура Scan_ПриЗаписиОтправленныеПисьма(Источник) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.Scan_ЗаявкаНаСервисныеРаботы") Тогда
	
		УстановитьНовыйВнутреннийНомер(Источник);
		
	КонецЕсли;	//rarus tenkam 23.11.2017 bug 9428 +
		
КонецПроцедуры

Процедура УстановитьНовыйВнутреннийНомер(ЗаявкаНаСервис)

	СтруктураНомера = ПолучитьСтруктуруНомера(ЗаявкаНаСервис);		

	Если СтруктураНомера <> Неопределено Тогда
	
		Если СтруктураНомера.ВнутреннийНомерЧислом <> 0 Тогда
		
			ДокументОбъект = ЗаявкаНаСервис.ПолучитьОбъект();
			ДокументОбъект.НомерДокументаВнутренний = СтруктураНомера.НомерДокументаСДефисом + (СтруктураНомера.ВнутреннийНомерЧислом + 1);
			// rarus tenkam 09.02.2017 mantis 9428 +++
			//ДокументОбъект.Записать
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			// rarus tenkam 09.02.2017 mantis 9428 ---
		КонецЕсли;	
	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруНомера(ЗаявкаНаСервис)

	НомерДокументаВнутренний = ЗаявкаНаСервис.НомерДокументаВнутренний;

	ПозицияПрефикса = СтрНайти(НомерДокументаВнутренний, "-");
	
	Если ПозицияПрефикса = 0 Тогда
	
		Возврат Неопределено;
	
	КонецЕсли;
	
	СтруктураНомера = Новый Структура;
	СтруктураНомера.Вставить("НомерДокументаСДефисом", Лев(НомерДокументаВнутренний, ПозицияПрефикса));
	СтруктураНомера.Вставить("ВнутреннийНомер", Сред(НомерДокументаВнутренний, ПозицияПрефикса + 1));
	СтруктураНомера.Вставить("ВнутреннийНомерЧислом", 0);
	
	Попытка
		СтруктураНомера.Вставить("ВнутреннийНомерЧислом", Число(СтруктураНомера.ВнутреннийНомер));    	
	Исключение	
	КонецПопытки;	
	
	Возврат СтруктураНомера;
	
КонецФункции

Процедура Scan_УстановкаСтатусаВРаботеЗаявкиНаСервисныеРаботы(СтруктураПараметров = Неопределено) Экспорт //rarus vikhle 23.06.2021 mt 17645 + СтруктураПараметров
	
	// Создать регламентное задание «Установка статуса в работе заявки на сервисные работы». 
	// Алгоритм работы задания: При Дате ПК = Дате (план) документа «Заявка на сервисные работы» 
	// (для заявок со статусом «новая») устанавливать статус «В Работе».
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.Scan_УстановкаСтатусаВРаботеЗаявкиНаСервисныеРаботы);//rarus vikhle 05.07.2021 апк
	Scan_СборСтатистики.Scan_ЗапускРЗ(Метаданные.РегламентныеЗадания.Scan_УстановкаСтатусаВРаботеЗаявкиНаСервисныеРаботы.Наименование); // Rarus tenkam 11.04.2022 mantis 18433 +

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ЗаявкаНаСервисныеРаботы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Scan_ЗаявкаНаСервисныеРаботы КАК Scan_ЗаявкаНаСервисныеРаботы
	               |ГДЕ
	               |	Scan_ЗаявкаНаСервисныеРаботы.ДатаНачалаРабот <= &Дата
	               |	И НЕ Scan_ЗаявкаНаСервисныеРаботы.ПометкаУдаления
	               |	И Scan_ЗаявкаНаСервисныеРаботы.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Статус", Справочники.Scan_СтатусыЗаявокНаРаботы.Подтверждена);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокументОбъект.Статус = Справочники.Scan_СтатусыЗаявокНаРаботы.ВРаботе;
			
			Попытка
			
				ДокументОбъект.Записать();
			
			Исключение
			
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// rarus tenkam 16.02.2018 mantis 9428 +++ интеграция
Процедура Scan_ПриЗаписиЗаявкаНаСервисныеРаботыПриЗаписи(Источник, Отказ) Экспорт
	Если НЕ Отказ Тогда
		Если ТипЗнч(Источник) = Тип("ДокументСсылка.Scan_ЗаявкаНаСервисныеРаботы") Тогда
			
			// Если только создан, то отправим данные в 1БД
			// Если режим = проведение и в регистре нет данных по документу 
			Если Источник.Проведен Тогда
					
			КонецЕсли;
			
		КонецЕсли  		
	КонецЕсли;

КонецПроцедуры
// rarus tenkam 16.02.2018 mantis 9428 --- интеграция
